Repository: danfordChris/code_challenge
Catalog: lib/l10n/intl_*.arb
Languages: sw

source: Task Boards
sw: Mbao za Kazi

source: ACTIVE
sw: INAYOFANYA KAZI

source: TOTAL
sw: JUMLA

source: DONE
sw: IMEKWISHA

source: Your Boards
sw: Mbao Zako

source: No boards yet
sw: Hakuna mbao bado

# createBoardMessage
source: Create your first board to get started
sw: Unda mbao yako ya kwanza kuanza

# failedToLoadData
source: Failed to load {dataType}:
sw: Imeshindwa kupakia {dataType}:

# failedToSaveData
source: Failed to save {dataType}:
sw: Imeshindwa kuhifadhi {dataType}:

# failedToDeleteData
source: Failed to delete {dataType}:
sw: Imeshindwa kufuta {dataType}:

# failedToUpdateData
source: Failed to update {dataType}:
sw: Imeshindwa kusasisha {dataType}:

source: Task
sw: Kazi

source: Board
sw: Mbao

source: To Do
sw: Ya Kufanya

source: In Progress
sw: Inaendelea

# doneStatus
source: Done
sw: Imekwisha

source: Add Task
sw: Ongeza Kazi

source: Edit Task
sw: Hariri Kazi

source: Delete Task
sw: Futa Kazi

source: High
sw: Juu

source: Medium
sw: Kati

source: Low
sw: Chini

source: Progress
sw: Maendeleo

source: Total Tasks
sw: Jumla ya Kazi

source: Completed
sw: Imekamilika

# deleteTaskQuestion
source: Are you sure you want to delete this task?
sw: Una uhakika unataka kufuta kazi hii?

source: Cancel
sw: Ghairi

source: Delete
sw: Futa

# titleRequired
source: Title is required
sw: Jina linahitajika

source: Edit Board
sw: Hariri Mbao

# taskTittle
source: Task title *
sw: Jina la kazi *

source: Description
sw: Maelezo

# descriptionHint
source: Add description (optional)
sw: Ongeza maelezo (si lazima)

source: Priority
sw: Kipaumbele

source: Task Priority
sw: Kipaumbele cha Kazi

source: Status
sw: Hali

source: Task Status
sw: Hali ya Kazi

source: Save
sw: Hifadhi

source: Board name is required
sw: Jina la mbao linahitajika

source: Create Board
sw: Unda Mbao

source: Board Name *
sw: Jina la Mbao *

# dayAgo
source: d ago
sw: s iliyopita

# hourAgo
source: h ago
sw: saa iliyopita

# minuteAgo
source: m ago
sw: d iliyopita

source: Just now
sw: Sasa hivi

source: Edit
sw: Hariri

source: Tasks
sw: Kazi

source: Dismiss
sw: Ondoa

source: Settings
sw: Mipangilio

source: Reset Settings
sw: Weka upya Mipangilio

# resetSettingsMessage
source: Are you sure you want to reset all settings to default?
sw: Una uhakika unataka kuweka upya mipangilio yote kwa chaguomsingi?

source: Reset
sw: Weka upya

source: Settings reset to default
sw: Mipangilio imewekwa upya kwa chaguomsingi

source: Appearance
sw: Mwonekano

source: Language
sw: Lugha

# version
source: Version {version}
sw: Toleo {version}

# changeLanguageMessage
source: Language changed to {language}
sw: Lugha imebadilishwa hadi {language}

source: Theme Mode
sw: Hali ya Mandhari

# themeModeMessage
source: Choose your preferred theme appearance
sw: Chagua mwonekano wa mandhari unaoupendelea

source: Dark Mode
sw: Hali ya Giza

source: Light Mode
sw: Hali ya Mwanga

source: System Mode
sw: Hali ya Mfumo

source: Populate Database
sw: Jaza Hifadhidata

source: Clear Database
sw: Futa Hifadhidata

# populateDatabaseMessage
source: This will add sample data to your database. Are you sure?
sw: Hii itaongeza data ya mfano kwenye hifadhidata yako. Una uhakika?

# clearDatabaseMessage
source: This will delete all boards and tasks. This action cannot be undone. Are you sure?
sw: Hii itafuta mbao na kazi zote. Kitendo hiki hakiwezi kutenduliwa. Una uhakika?

# databasePopulated
source: Database populated successfully
sw: Hifadhidata imejazwa kwa mafanikio

# databaseCleared
source: Database cleared successfully
sw: Hifadhidata imefutwa kwa mafanikio

# searchHint
source: Search boards or tasks...
sw: Tafuta mbao au kazi...

source: Results
sw: Matokeo

source: Clear Filter
sw: Futa Kichujio

source: No results found
sw: Hakuna matokeo yaliyopatikana

# filterByStatus
source: Filter by Task Status
sw: Chuja kwa Hali ya Kazi

source: All
sw: Zote

source: Data Management
sw: Usimamizi wa Data

source: Failed to clear database
sw: Imeshindwa kufuta hifadhidata

source: Failed to reset settings
sw: Imeshindwa kuweka upya mipangilio

source: Failed to load settings
sw: Imeshindwa kupakia mipangilio

source: Failed to change language
sw: Imeshindwa kubadilisha lugha

source: Failed to change theme
sw: Imeshindwa kubadilisha mandhari

source: Failed to populate database
sw: Imeshindwa kujaza hifadhidata

source: Failed to export data
sw: Imeshindwa kusafirisha data

source: Export Data
sw: Safirisha Data

source: Import Data
sw: Ingiza Data

# exportDataMessage
source: This will export your boards and tasks to a JSON file. Are you sure?
sw: Hii itasafirisha mbao zako na kazi zako kwenye faili la JSON. Una uhakika?

# importDataMessage
source: This will import boards and tasks from a JSON file. This may overwrite existing data. Are you sure?
sw: Hii itaingiza mbao na kazi kutoka kwa faili la JSON. Hii inaweza kuandika data iliyopo. Una uhakika?

# dataExported
source: Data exported successfully
sw: Data imesafirishwa kwa mafanikio

source: Data imported successfully
sw: Data imeingizwa kwa mafanikio

source: Failed to import data
sw: Imeshindwa kuingiza data
